// Строки:
// 1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.

// let str = "Привет,Мир!";
// console.log(str);

// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.

// let str1 = "Привет,",
//   str2 = "Мир!";
// console.log(str1.concat(str2));

// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.

// let name = "Айдай!";
// console.log(`Привет,${name}`);

// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.

// let age = "23";
// console.log(`Мне ${age} года!`);

// 5. Вам даны четыре переменные.
// Первая - для хранения количества дней. Присвойте ей значение "365".
// Вторая - для хранения названия нашей планеты "Земля".
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// Четвертая - для хранения слова "Солнце".
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."

// let day = "365";
// let land = "Земля";
// let str = "7 млрд.";
// let str2 = "Солнце";
// console.log(
//   `В нашем году ${day} дней.Днем у нас светит ${str2}. Население планеты ${land} состовляет примерно ${str} человек.`
// );

// 1. Вам дана переменная str = 'Nevis ITDB TECH'. Выведите в консоль длину первого слова.

// let str = "Nevis ITDB TECH";
// console.log(str.slice(0, 5).length);

// 2. Вам дана переменная str = 'Максимально УЖАСНО'. Выведите в консоль слово УЖАСНО,

// let str = "Максимально УЖАСНО";
// console.log(str.slice(-6));

// 3. Вам дана переменная str = 'максимально УЖАСНО'. Выведите в консоль слово максимально,
// только верхним регистром.

// let str = "максимально УЖАСНО";
// console.log(str.slice(0, 11).toUpperCase());

// 6. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль 'мально Ужасно',
// используя метод slice.

// let str = "Максимально Ужасно";
// console.log(str.slice(-13));

// 7. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль букву У, использую метод
// charAt.

// let str = "Максимально Ужасно";
// console.log(str.charAt(12));

// 8. Вам даны переменные str = 'Максимально', str2 = 'Ужасно'. Выведите в консоль соединенные
// строки, используя метод concat.

// let str = "Максимально ";
// let str2 = "Ужасно";
// console.log(str.concat(str2));

// 10. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль "встречается более 1
// раза", если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"
// let str = "Максимально Ужасно"
// 11. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в консоль первую букву
//  в верхний регистр.

// let str = "макСИМАЛЬНО ужаСНО";
// console.log(str.charAt(0).toUpperCase());

// 12. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого вхождения
// буквы а.

// let str = "Максимально Ужасно";
// console.log(str.indexOf("а"));

// 13. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль индекс первого последнего
// буквы о.

// let str = "Максимально Ужасно";
// console.log(str.lastIndexOf("о"));

// 14. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя разными способами
// (через substr, substring, slice) и выведите в консоль.

// let str = "aaa bbb ccc";
// console.log(str.substr(3, 4));

// let str = "aaa bbb ccc";
// console.log(str.substring(4, 7));

// let str = "aaa bbb ccc";
// console.log(str.slice(4, 7));
